# Используем официальный образ Node.js как базовый
FROM node:18-alpine

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем package.json и package-lock.json (или yarn.lock) для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь исходный код в контейнер
COPY . .

# Сборка проекта (используем команду для SSG или SSR, в зависимости от твоих настроек)
RUN npm run build

# Порт, который будет использоваться контейнером
EXPOSE 3000

# Команда для запуска приложения
CMD ["npm", "start"]