import Article from "./article";

export default function RepetitorPoProgrammirovaniyu(
  { price }: { price: string }
) {
  return <Article>
    <h2>Кто такой репетитор по веб-программированию?</h2>
    <p>Репетитор по веб-программированию – это опытный веб-разработчик, который проводит занятия персонально с учеником, объясняя современные веб-технологии понятным и доступным языком. Помимо веб-технологий, такой специалист умеет работать с базами данных, что позволяет разрабатывать полноценные Fullstack-проекты.</p>
    <p>Сегодня знание веб-программирования – это ключ к профессиональной реализации в одной из самых востребованных и быстрорастущих сфер. Если вы родитель, который заботится об успешном будущем своего ребёнка, услуги репетитора по веб-программированию станут отличным выбором. Или вы сами хотите развиваться в этой области? В любом случае не откладывайте – напишите нам, чтобы получить консультацию и назначить первое занятие.</p>
    <h2>Что вы изучите с нашим репетитором по веб-программированию?</h2>
    <p>Преподаваемый стек технологий: JavaScript, TypeScript, SQL, HTML, CSS, React и Next.js. Наш репетитор является экспертом в этих областях и предлагает персональные занятия, чтобы вы могли глубже разобраться в каждом из этих инструментов. Обратите внимание: обучение проводится только по перечисленным технологиям. Это позволяет нам гарантировать высокое качество занятий, так как репетитор – узкоспециализированный профессионал с большим опытом работы в этих сферах. Мы ценим ваше и наше время, поэтому сосредотачиваемся на тех темах, где можем быть максимально полезными.</p>
    <h2>Насколько опытен наш репетитор?</h2>
    <p>Наш репетитор имеет техническое образование по специальности "Программная инженерия". Более восьми лет опыта в IT-сфере – разработка и поддержка как десктопных приложений, так и полноценных веб-приложений. Более пяти лет преподавания с наработанным подходом к обучению и гибкостью в учёте потребностей каждого ученика.</p>
    <h2>Почему стоит выбрать индивидуальные занятия?</h2>
    <p>Персонализированный подход. Каждый ученик уникален, поэтому обучение строится с учётом ваших целей, текущего уровня знаний и предпочтений. Репетитор помогает освоить как базовые концепции, так и углублённые темы.</p>
    <p>Гибкий график. Вам не придётся подстраиваться под расписание групповых занятий. Репетитор предложит удобное время для уроков, что особенно важно для тех, кто совмещает учёбу или работу.</p>
    <p>Эффективное обучение. На индивидуальных занятиях вы получаете максимум внимания от преподавателя. Это позволяет задавать вопросы, разбирать сложные моменты и двигаться вперёд в удобном темпе.</p>
    <p>Онлайн-формат. Поскольку обучение проходит онлайн, вы сможете заниматься из любого удобного для вас места. Такой подход не только удобен, но и выгоден, так как обе стороны не тратят лишнее время и силы, а концентрируются на учебном процессе.</p>
    <h2>Сколько стоит занятие?</h2>
    <p>Стоимость занятий для каждого отдельного случая индивидуальна, так как уровень знаний и конечные цели у каждого ученика разные. Однако минимальная стоимость одного часа занятия стартует от {price}.</p>
  </Article>;
}