export default function SozdanieVebProektaSNulya(
  { styles }: { styles: string }
) {
  return <div className={styles}>
    <h2>Кто мы?</h2>
    <p>Создание качественного веб-сайта – это ресурсоёмкий и правильно стратегически выстроенный процесс. Мы разрабатываем сайты с нуля: от создания уникального дизайна до деплоя на хостинг. Наша команда специализируется на создании веб-проектов в оригинальном стиле, с полезной и ненагруженной функциональностью, а также современной SEO-оптимизацией.</p>
    <p>Стоит отметить, что помимо оригинального внешнего вида вашего будущего сайта, который разработают наши дизайнеры, вы получите индивидуально разработанный код проекта. Мы не используем конструкторы и шаблоны – код пишется с нуля профессиональными разработчиками, с соблюдением современных концепций программирования и использованием передовых технологий, таких как HTML, CSS, TypeScript, React, Next.js, Prisma ORM и других.</p>
    <p>Мы разрабатываем сайты, ориентируясь на баланс между дизайном и скоростью загрузки страниц. Используем различные тесты для оптимизации загрузочного процесса, достигая наилучших показателей, что положительно влияет на восприятие сайта поисковыми системами.</p>
    <p>Разработаем сайт под ключ, будь то Landing Page, сайт визитка или другой веб-проект, учитывая все ваши пожелания и в оговоренные сроки.</p>
    <h2>Какие сроки?</h2>
    <p>Рассказы о быстром и качественном – ложь. Тем не менее мы сможем реализовать проект в разумные сроки: не мгновенно, но достаточно быстро. Минимальный срок разработки – семь дней. Чем сложнее проект, тем больше времени потребуется на его выполнение.</p>
    <h2>Сколько стоит?</h2>
    <p>Каждый проект уникален и его цена будет зависеть от многих факторов. В первую очередь мы выслушиваем требования к веб-проекту, а затем анализируем сколько ресурсов у нас может занять разработка. Поскольку к процессу мы подходим профессионально, мы сможем сказать точную стоимость только после общения с вами, однако минимальная стоимость для данной услуги стартует от 9000 RUB.</p>
    <h2>Почему мы, а не конструктор сайтов?</h2>
    <p>Проблемы с SEO-оптимизацией. Несмотря на наличие базовых инструментов для SEO, возможности конструкторов сайтов часто ограничены. Например, избыточное количество визуальных блоков и анимаций, предоставленных излишними библиотеками, может замедлять загрузку страниц, что отрицательно сказывается на их позициях в поисковых системах.</p>
    <p>Ещё один недостаток – использование шаблонных блоков, а иногда и целых шаблонов сайтов, которые используют многие пользователи. Это снижает SEO-показатели, так как поисковые системы отдают предпочтение уникальному контенту.</p>
    <p>Ограниченная кастомизация. Хотя конструкторы и предоставляют набор готовых блоков и шаблонов, возможности для их персональной настройки ограничены. Это может затруднить создание неповторимого дизайна или функционала, особенно если требуется что-то выходящее за рамки стандартных предложений платформы.</p>
    <p>Зависимость от платформы. Вы будете полностью зависеть от платформы на которой создали сайт. При необходимости смены домена или хостинга, могут возникнуть сложности как с самим процессом, так и с изменением кода под новые требования.</p>
    <p>На самом деле, помимо основных уже перечисленных минусов конструкторов сайтов, их ещё немало, например, ограниченный доступ к исходному коду, высокая стоимость при расширении функционала и так далее. Мы могли бы дальше перечислять их и подробно рассматривать. Но мы понимаем, что если вы уже решили обратиться к нам, значит, вы ищете тех, кто сделает для вас качественный и неповторимый веб-проект, полностью созданный с нуля и оптимизированный под ваши цели и возможности с последующей полной передачей его под ваше управление.</p>
  </div>;
}